app/Controllers/Admins/AdminsController.php

SELECT *
FROM `admins`
WHERE `email` = 'admin.first@yahoo.com'
 LIMIT 1
---
    public function checkLogin() {

        $session = session();
        $admin = new Admin();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $admin->where('email', $email)->first();

SELECT COUNT(*) AS `numrows`
FROM `properties`
SELECT COUNT(*) AS `numrows`
FROM `admins`
---
    public function index() {


        $session = session();

        $propsCount = $this->db->table('properties')
         ->countAllResults();

        $adminsCount = $this->db->table('admins')
         ->countAllResults();

         $homeTypesCount = $this->db->table('admins')
         ->countAllResults();

SELECT *
FROM `admins`
---
    public function displayAdmins() {


        $session = session();

        $admins = new Admin();

        $allAdmins = $admins->findAll();

SELECT *
FROM `hometypes`
---
    public function displayHomeTypes() {


        $session = session();

        $homeTypes = new HomeType();

        $allHomeTypes = $homeTypes->findAll();

SELECT *
FROM `properties`
---
    public function displayProps() {


        $session = session();

        $props = new Property();

        $allProps = $props->findAll();

SELECT *
FROM `requests`
---
    public function displayRequests() {


        $session = session();

        $requests = new Request();

        $allRequests = $requests->findAll();